h1. Issues

1. Route target advertised to Customer by default in Junos
2. ASN double tagged from Junos to local CE in IPVPN
3. iBGP between IPVPN and VRF-Lite

eve-ng lab: https://eve-ng.lam.cenic.org/legacy/Shared/Josh/HPR%20IPVPN.unl/topology

h1. Route Target

- Junos advertises RT communities by default to local CE
- Should strip all RT communities on export
{code:title=EXAMPLE|linenumbers=true|language=text|collapse=true}
- NOTE: cust1 is local CE to vMX

cust1#show bgp 100.20.0.0/17 | in RT
      Extended Community: RT:2152:2153

community RT members target:*:*;
policy-statement daa {
    term t00 {
        then {
            community delete RT;
            default-action accept;
        }
    }
}

cust1# show ip bgp 100.20.0.0/17 | in RT
cust1#

{code}

h1. IPVPN Double Tagged ASN

- Adding {{autonomous-system ASN}} under routing-instances config will cause the ASN to be double tagged on the remote CE. No need to add this on IPVPN instances.
- {{local-as ASN private no-prepend-global-as}} must be added to Junos IPVPN instance to prevent double-tagging ASN to remote CE (does not stack with previous bullet)
{code:title=EXAMPLE|linenumbers=true|language=text|collapse=true}
- NOTE: cust2 is remote CE to vMX

cust2#show ip bgp | in 65501
 *>   100.10.0.0/17    100.20.0.0                             0 2153 2153 65501 i
 *>   100.10.0.0/16    100.20.0.0                             0 2153 2153 65501 i
 *>   100.10.128.0/17  100.20.0.0                             0 2153 2153 65501 i

[edit routing-instances {{ VRF }} protocols bgp group {{ PEER GROUP }}]
root@r0# set local-as 2153 private no-prepend-global-as

cust2#show ip bgp | in 65501
 *>   100.10.0.0/17    100.20.0.0                             0 2153 65501 i
 *>   100.10.0.0/16    100.20.0.0                             0 2153 65501 i
 *>   100.10.128.0/17  100.20.0.0                             0 2153 65501 i

{code}

h1. HPR--VPN Route Exchange

1. Must be transparent to users on both HPR and HPR IPVPN, so routes must stay as BGP
2. Use logical-tunnel on MX, peer iBGP between the two logical units
3. Must set HPR side of peering as a route-reflector
4. NHS should be set both directions
5. HPR IPVPN side needs {{private}} option on {{local-as}} for same reasons as previous issue
{code:title=PEERING|linenumbers=true|language=text|collapse=true}
- HPR peering to HPR IPVPN

root@r0> ...ing-instances hpr protocols bgp group hpr_vpn--peering
type internal;
local-address 10.1.1.129;
family inet {
    unicast;
}
export next-hop-self;
cluster 10.1.1.129;
peer-as 2153;
local-as 2153 no-prepend-global-as;
neighbor 10.1.1.128;


- HPR IPVPN peering to HPR

root@r0> ...n routing-instances hpr_vpn protocols bgp group hpr--peering
type internal;
local-address 10.1.1.128;
family inet {
    unicast;
}
export next-hop-self;
peer-as 2153;
local-as 2153 private no-prepend-global-as;
neighbor 10.1.1.129;

{code}

{code:title=CE ROUTES|linenumbers=true|language=text|collapse=true}
cust1#show ip bgp | in 2153
 *>   10.1.1.128/31    100.10.0.0                             0 2153 i
 s    100.10.0.0/31    100.10.0.0                             0 2153 i
 *>   100.20.0.0/17    100.10.0.0                             0 2153 65502 i
 *>   100.20.0.0/16    100.10.0.0                             0 2153 65502 i
 *>   100.20.128.0/17  100.10.0.0                             0 2153 65502 i
 *>   100.30.0.0/17    100.10.0.0                             0 2153 65503 i
 *>   100.30.0.0/16    100.10.0.0                             0 2153 65503 i
 *>   100.30.128.0/17  100.10.0.0                             0 2153 65503 i
 *>   100.40.0.0/17    100.10.0.0                             0 2153 65504 i
 *>   100.40.0.0/16    100.10.0.0                             0 2153 65504 i
 *>   100.40.128.0/17  100.10.0.0                             0 2153 65504 i

cust2#show ip bgp | in 2153
 *>   10.1.1.128/31    100.20.0.0                             0 2153 i
 *>   100.10.0.0/31    100.20.0.0                             0 2153 i
 *>   100.10.0.0/17    100.20.0.0                             0 2153 65501 i
 *>   100.10.0.0/16    100.20.0.0                             0 2153 65501 i
 *>   100.10.128.0/17  100.20.0.0                             0 2153 65501 i
 *>   100.30.0.0/17    100.20.0.0                             0 2153 65503 i
 *>   100.30.0.0/16    100.20.0.0                             0 2153 65503 i
 *>   100.30.128.0/17  100.20.0.0                             0 2153 65503 i
 *>   100.40.0.0/17    100.20.0.0                             0 2153 65504 i
 *>   100.40.0.0/16    100.20.0.0                             0 2153 65504 i
 *>   100.40.128.0/17  100.20.0.0                             0 2153 65504 i

cust3#show ip bgp | in 2153
 *>   100.10.0.0/17    100.30.0.0                             0 2153 65501 i
 *>   100.10.0.0/16    100.30.0.0                             0 2153 65501 i
 *>   100.10.128.0/17  100.30.0.0                             0 2153 65501 i
 *>   100.20.0.0/17    100.30.0.0                             0 2153 65502 i
 *>   100.20.0.0/16    100.30.0.0                             0 2153 65502 i
 *>   100.20.128.0/17  100.30.0.0                             0 2153 65502 i
 *>   100.40.0.0/17    100.30.0.0                             0 2153 65504 i
 *>   100.40.0.0/16    100.30.0.0                             0 2153 65504 i
 *>   100.40.128.0/17  100.30.0.0                             0 2153 65504 i

cust4#show ip bgp | in 2153
 *>   100.10.0.0/17    100.40.0.0                             0 2153 65501 i
 *>   100.10.0.0/16    100.40.0.0                             0 2153 65501 i
 *>   100.10.128.0/17  100.40.0.0                             0 2153 65501 i
 *>   100.20.0.0/17    100.40.0.0                             0 2153 65502 i
 *>   100.20.0.0/16    100.40.0.0                             0 2153 65502 i
 *>   100.20.128.0/17  100.40.0.0                             0 2153 65502 i
 *>   100.30.0.0/17    100.40.0.0                             0 2153 65503 i
 *>   100.30.0.0/16    100.40.0.0                             0 2153 65503 i
 *>   100.30.128.0/17  100.40.0.0                             0 2153 65503 i

{code}

{code:title=PINGS|linenumbers=true|language=text|collapse=true}
cust4#ping 100.30.128.0 source 100.40.128.0
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 100.30.128.0, timeout is 2 seconds:
Packet sent with a source address of 100.40.128.0
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 2/3/9 ms

cust4#ping 100.20.128.0 source 100.40.128.0
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 100.20.128.0, timeout is 2 seconds:
Packet sent with a source address of 100.40.128.0
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/4/6 ms

cust4#ping 100.10.128.0 source 100.40.128.0
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 100.10.128.0, timeout is 2 seconds:
Packet sent with a source address of 100.40.128.0
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 2/2/3 ms

{code}